app/views/albums/_form.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."artist_id" = ? AND "albums"."id" = ? LIMIT 1  [["artist_id", 87], ["id", 80]]
---
<%= form_for([@artist, @artist.albums.build]) do |f| %>
  <% if @artist.album.errors.any? %>