app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]
---
	def new
		@artist = Artist.find(params[:artist_id])
    	@album = @artist.albums.find(params[:id])