app/controllers/artists_controller.rb

	def index
		@artists = Artist.all.order(:name)
---
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" ASC

	def create
		@artist = Artist.new(artist_params)
		if @artist.save
---
INSERT INTO "artists" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["bio", "dog"], ["created_at", "2015-06-02 07:27:08.795624"], ["updated_at", "2015-06-02 07:27:08.795624"]]

	def update
 	 	@artist = Artist.find params[:id]
  		if @artist.update(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 72]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Two Door Cinema Club 2"], ["updated_at", "2015-06-02 08:22:45.475422"], ["id", 72]]

 	def destroy
   		@artist = Artist.find params[:id]
    	@artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 46]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 46]]