app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"  ORDER BY "songs"."name" ASC
---
	def index
		@songs = Song.all.order(:name)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]
---
	def new
		@song = Song.new
		@album = Album.find(params[:album_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "songs" ("name", "time", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Something Good Can Work"], ["time", 300], ["album_id", 11], ["created_at", "2015-06-02 00:14:12.571047"], ["updated_at", "2015-06-02 00:14:12.571047"]]
---
	def create
		@album = Album.find(params[:album_id])

		@song = @album.songs.create(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 6]]
---
    def like
		@song = Song.find(params[:id])