app/controllers/welcome_controller.rb

	def index
		@artists = Artist.all.order(:name)
		@albums = Album.all.order(:name)
---
SELECT "artists".* FROM "artists"  ORDER BY "artists"."name" ASC
SELECT "albums".* FROM "albums"  ORDER BY "albums"."name" ASC